index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<!-- 2017-08-11 Fri 20:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yjr" />
</head>
<body>
<div id="content">
<h1 class="title">index</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Intro</a></li>
<li><a href="#sec-2">2. User</a>
<ul>
<li><a href="#sec-2-1">2.1. 如何linux cli shell实现windows win-r功能？</a></li>
<li><a href="#sec-2-2">2.2. 如何linux cli shell快速切换进程（tty）？</a></li>
<li><a href="#sec-2-3">2.3. 如何linux gui shell（gnome）快速切换进程（应用）？</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Dev</a>
<ul>
<li><a href="#sec-3-1">3.1. 如何wmctrl修改-l的顺序？</a></li>
<li><a href="#sec-3-2">3.2. <span class="done DONE">DONE</span> 如何linux删除gnome shell extension？</a></li>
<li><a href="#sec-3-3">3.3. <span class="done DONE">DONE</span> 如何linux安装gnome shell extension？</a></li>
<li><a href="#sec-3-4">3.4. <span class="done DONE">DONE</span> 如何linux gnome显示taskbar？</a></li>
<li><a href="#sec-3-5">3.5. 如何dnf检索已安装的软件？</a></li>
<li><a href="#sec-3-6">3.6. <span class="done DONE">DONE</span> 如何linux cli使用默认软件打开文件（实现windows start命令）？</a></li>
<li><a href="#sec-3-7">3.7. <span class="done DONE">DONE</span> 如何linux cli设置gnome shell文件默认打开的软件（default application）？</a></li>
<li><a href="#sec-3-8">3.8. <span class="done DONE">DONE</span> 如何linux gui shell切换cli shell？</a></li>
<li><a href="#sec-3-9">3.9. <span class="done DONE">DONE</span> 如何python获取shell变量值？</a></li>
<li><a href="#sec-3-10">3.10. <span class="done DONE">DONE</span> 如何python切割string为数组？</a></li>
<li><a href="#sec-3-11">3.11. <span class="done DONE">DONE</span> 如何python遍历目录（非递归）？</a></li>
<li><a href="#sec-3-12">3.12. <span class="done DONE">DONE</span> 如何python for遍历数组？</a></li>
<li><a href="#sec-3-13">3.13. 如何python判断file name和字符串是否相同？</a></li>
<li><a href="#sec-3-14">3.14. <span class="done DONE">DONE</span> 如何python判断变量类型？</a></li>
<li><a href="#sec-3-15">3.15. <span class="done DONE">DONE</span> 如何python执行shell命令？</a></li>
<li><a href="#sec-3-16">3.16. <span class="done DONE">DONE</span> 如何python拼接字符串？</a></li>
<li><a href="#sec-3-17">3.17. <span class="done DONE">DONE</span> 如何python退出脚本？</a></li>
<li><a href="#sec-3-18">3.18. <span class="done DONE">DONE</span> 如何python subprocess异步执行shell命令？</a></li>
<li><a href="#sec-3-19">3.19. <span class="done DONE">DONE</span> 如何emacs异步执行shell command？</a></li>
<li><a href="#sec-3-20">3.20. <span class="done DONE">DONE</span> 如何emacs异步执行shell command xdg-open？</a></li>
<li><a href="#sec-3-21">3.21. <span class="done DONE">DONE</span> 如何linux gnome取消进程或程序分组？</a></li>
<li><a href="#sec-3-22">3.22. <span class="done DONE">DONE</span> 如何gsetting解决设置value时报错unknown keyword？</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
使用linux进行开发（代码、文档）、应用（处理（检索））
emacs实现资源管理器、加载器（win-r）、gtd。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 如何linux cli shell实现windows win-r功能？</h3>
<div class="outline-text-3" id="text-2-1">
<p>
？模拟win-r的功能。快速启动程序或文件（普通文件或目录）。
</p>

<pre class="example">
m-&amp; $file
</pre>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 如何linux cli shell快速切换进程（tty）？</h3>
<div class="outline-text-3" id="text-2-2">
<p>
？实现windows m-num切换进程。快速加载程序。
</p>

<pre class="example">
screen

c-a num
</pre>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 如何linux gui shell（gnome）快速切换进程（应用）？</h3>
<div class="outline-text-3" id="text-2-3">
<p>
？实现windows m-num切换进程。快速加载程序。
</p>

<pre class="example">
https://www.google.com/search?biw=1280&amp;bih=532&amp;q=gnome+windows+win+num+switch+application

https://superuser.com/questions/614792/how-to-enable-windows-key-number-in-gnome-to-switch-to-a-window-in-the-taskbar
GNOME 3 does not have this functionality built-in, as you have discovered.
wmctrl

https://askubuntu.com/questions/73030/can-i-get-unity-style-super1-9-keyboard-shortcuts-for-launching-apps-in-gnome
wmctrl
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Dev</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 如何wmctrl修改-l的顺序？</h3>
<div class="outline-text-3" id="text-3-1">
<p>
？实现windows拖动修改进程顺序。实现windows m-num切换进程。快速加载程序。
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="done DONE">DONE</span> 如何linux删除gnome shell extension？</h3>
<div class="outline-text-3" id="text-3-2">
<p>
？测试gnome shell extension Dash to Dock
</p>

<pre class="example">
https://extensions.gnome.org
Installed Extensions 

点红叉（没有提示，直接删除）
</pre>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="done DONE">DONE</span> 如何linux安装gnome shell extension？</h3>
<div class="outline-text-3" id="text-3-3">
<p>
？安装gnome taskbar。
</p>

<pre class="example">
https://www.google.com/search?q=how+install+gnome+shell+extension&amp;ie=utf-8&amp;oe=utf-8
https://askubuntu.com/questions/75530/how-do-i-install-and-manage-gnome-shell-extensions
https://extensions.gnome.org
</pre>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="done DONE">DONE</span> 如何linux gnome显示taskbar？</h3>
<div class="outline-text-3" id="text-3-4">
<p>
？实现windows m-num切换进程。快速加载程序。
</p>

<pre class="example">
https://extensions.gnome.org
taskbar
</pre>

<p>
无法修改顺序，也没有win-num功能。
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 如何dnf检索已安装的软件？</h3>
<div class="outline-text-3" id="text-3-5">
<p>
？dnf安装gnome taskbar。
</p>

<pre class="example">
https://www.google.com/search?q=dnf+installed+list&amp;ie=utf-8&amp;oe=utf-8
https://docs.fedoraproject.org/en-US/Fedora/23/html/System_Administrators_Guide/sec-Listing_Packages.html
dnf list installed *gnome*
</pre>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <span class="done DONE">DONE</span> 如何linux cli使用默认软件打开文件（实现windows start命令）？</h3>
<div class="outline-text-3" id="text-3-6">
<p>
？模拟win-r的功能。快速启动程序或文件（普通文件或目录）。
</p>

<pre class="example">
https://www.google.com/search?q=how+gnome+cli+set+default+application&amp;ie=utf-8&amp;oe=utf-8
https://askubuntu.com/questions/15354/how-to-open-file-with-default-application-from-command-line
xdg-open
</pre>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> <span class="done DONE">DONE</span> 如何linux cli设置gnome shell文件默认打开的软件（default application）？</h3>
<div class="outline-text-3" id="text-3-7">
<p>
？设置无后缀文件和目录使用emacs打开。模拟win-r的功能。快速启动程序或文件（普通文件或目录）
</p>

<pre class="example">
https://www.google.com/search?q=how+gnome+cli+set+default+application&amp;ie=utf-8&amp;oe=utf-8
http://linuxcommando.blogspot.com/2014/03/how-to-specify-default-applications-for.html

xdg-mime query default application/pdf 

xdg-mime default xpdf.desktop application/pdf

xdg-open somefile.pdf

https://www.google.com/search?q=xdg-mime+set+no+suffix+file&amp;ie=utf-8&amp;oe=utf-8
https://forum.kde.org/viewtopic.php?f=67&amp;t=108683
text/plain

man xdg-mime
xdg-mime query filetype /tmp/foobar.png
Prints the MIME type of the file /tmp/foobar.png, in this case image/png

xdg-mime query filetype $reg_file
text/plain

xdg-mime query filetype $dir_file
inode/directory
</pre>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> <span class="done DONE">DONE</span> 如何linux gui shell切换cli shell？</h3>
<div class="outline-text-3" id="text-3-8">
<p>
？测试xdg-open打开文本文件。
</p>

<pre class="example">
https://www.google.com/search?q=change+tty&amp;ie=utf-8&amp;oe=utf-8
https://unix.stackexchange.com/questions/167386/how-to-switch-between-tty-and-xorg-session

C-M-F3
</pre>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> <span class="done DONE">DONE</span> 如何python获取shell变量值？</h3>
<div class="outline-text-3" id="text-3-9">
<p>
？获取PATH变量，遍历所有目录。
</p>

<pre class="example">
https://www.google.com/search?q=python+get+shell+variable&amp;ie=utf-8&amp;oe=utf-8
https://stackoverflow.com/questions/17435056/read-bash-variables-into-a-python-script

import os
print os.environ["PATH"]

https://docs.python.org/2/library/os.html
15. Generic Operating System Services
15.1. os — Miscellaneous operating system interfaces
15.1.1. Process Parameters
</pre>
</div>
</div>
<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> <span class="done DONE">DONE</span> 如何python切割string为数组？</h3>
<div class="outline-text-3" id="text-3-10">
<p>
？切割PATH为目录数组。遍历PATH的所有目录。
</p>

<pre class="example">
https://www.google.com/search?q=python+cut+string
https://stackoverflow.com/questions/8247792/python-how-to-cut-a-string-in-python
s.split(separator)

https://docs.python.org/2/library/stdtypes.html#sequence-types-str-unicode-list-tuple-bytearray-buffer-xrange
5. Built-in Types
5.6.1. String Methods
</pre>
</div>
</div>

<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> <span class="done DONE">DONE</span> 如何python遍历目录（非递归）？</h3>
<div class="outline-text-3" id="text-3-11">
<p>
？遍历PATH的所有目录。快速启动程序或文件（普通文件或目录）。
</p>

<pre class="example">
https://www.google.com/search?q=python+traverse+dir&amp;ie=utf-8&amp;oe=utf-8
https://stackoverflow.com/questions/4918458/how-to-traverse-through-the-files-in-a-directory
os.listdir # 非递归

https://docs.python.org/3/library/os.html#os.listdir
https://docs.python.org/3/library/os.html#os.walk
</pre>
</div>
</div>

<div id="outline-container-sec-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> <span class="done DONE">DONE</span> 如何python for遍历数组？</h3>
<div class="outline-text-3" id="text-3-12">
<p>
？遍历PATH的所有目录。快速启动程序或文件（普通文件或目录）。
</p>

<pre class="example">
https://www.google.com/search?q=python+3+for+loop+manual
https://docs.python.org/3/tutorial/controlflow.html
&gt;&gt;&gt; for w in words:
...     print(w, len(w))

&gt;&gt;&gt; for i in range(5):
...     print(i)

https://docs.python.org/3/reference/compound_stmts.html#the-for-statement

for i in range(10):
    print(i)
    i = 5             # this will not affect the for-loop
                      # because i will be overwritten with the next
                      # index in the range
</pre>
</div>
</div>

<div id="outline-container-sec-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> 如何python判断file name和字符串是否相同？</h3>
</div>
<div id="outline-container-sec-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> <span class="done DONE">DONE</span> 如何python判断变量类型？</h3>
<div class="outline-text-3" id="text-3-14">
<p>
？files=os.listdir(d)，判断file类型。
</p>

<pre class="example">
https://www.google.com/search?q=python+check+variable+type&amp;ie=utf-8&amp;oe=utf-8
https://stackoverflow.com/questions/402504/how-to-determine-a-variables-type
Simple, for python 3.4 and above

print (type(variable_name))

Python 2.7 and above

print type(variable_name)

https://docs.python.org/3/library/functions.html
2. Built-in Functions
</pre>
</div>
</div>
<div id="outline-container-sec-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> <span class="done DONE">DONE</span> 如何python执行shell命令？</h3>
<div class="outline-text-3" id="text-3-15">
<p>
？调用linux xdg-open打开文件。
</p>

<pre class="example">
https://www.google.com/search?q=python+run+shell+command&amp;ie=utf-8&amp;oe=utf-8
https://stackoverflow.com/questions/89228/calling-an-external-command-in-python

from subprocess import call
call(["ls", "-l"])

import subprocess 
subprocess.call(["xdg-open", f])

https://docs.python.org/3/library/index.html
https://docs.python.org/3/library/subprocess.html
17. Concurrent Execution
</pre>

<p>
gnome-terminal运行脚本r不会阻塞gnome-terminal，emacs调用脚本r会阻塞emacs。
</p>
</div>
</div>
<div id="outline-container-sec-3-16" class="outline-3">
<h3 id="sec-3-16"><span class="section-number-3">3.16</span> <span class="done DONE">DONE</span> 如何python拼接字符串？</h3>
<div class="outline-text-3" id="text-3-16">
<p>
？转换文件相对路径为绝对路径。
</p>

<pre class="example">
https://www.google.com/search?q=python+string+join&amp;ie=utf-8&amp;oe=utf-8
str = "-";
seq = ("a", "b", "c"); # 字符串序列
print str.join( seq );
https://docs.python.org/3/library/stdtypes.html#str.join


https://www.google.com/search?q=python+string+append
https://stackoverflow.com/questions/4435169/good-way-to-append-to-a-string
s = ""
for i in range(n):
    s+=str(i)
https://www.google.com/search?q=python+plus+symbol+string
https://docs.python.org/3/library/operator.html
10.3. operator — Standard operators as functions
10.3.1. Mapping Operators to Functions
</pre>
</div>
</div>

<div id="outline-container-sec-3-17" class="outline-3">
<h3 id="sec-3-17"><span class="section-number-3">3.17</span> <span class="done DONE">DONE</span> 如何python退出脚本？</h3>
<div class="outline-text-3" id="text-3-17">
<p>
？异步执行脚本r，避免新建进程阻塞emacs。
</p>

<pre class="example">
https://www.google.com/search?q=python+exit+script&amp;ie=utf-8&amp;oe=utf-8
https://stackoverflow.com/questions/73663/terminating-a-python-script
import sys
sys.exit()

https://docs.python.org/3/library/sys.html
29. Python Runtime Services
</pre>

<p>
实际上没有实现需求，因为subprocess.call阻塞了脚本。
</p>
</div>
</div>

<div id="outline-container-sec-3-18" class="outline-3">
<h3 id="sec-3-18"><span class="section-number-3">3.18</span> <span class="done DONE">DONE</span> 如何python subprocess异步执行shell命令？</h3>
<div class="outline-text-3" id="text-3-18">
<p>
？解决subprocess.call([ "xdg-open", d+"/"+f ])阻塞。模拟win-r的功能。快速启动程序或文件（普通文件或目录）。
</p>

<pre class="example">
https://www.google.com/search?q=python+subprocess+async+call
https://stackoverflow.com/questions/636561/how-can-i-run-an-external-command-asynchronously-from-python
from subprocess import Popen
p = Popen(['watch', 'ls']) # something long running
# ... do other stuff while subprocess is running
p.terminate()

https://docs.python.org/3/library/subprocess.html
17. Concurrent Execution
17.5. subprocess — Subprocess management
</pre>

<p>
无法实现需求，emacs执行脚本时，执行shell命令，依然阻塞emacs。
</p>

<p>
gnome-terminal运行脚本r不会阻塞gnome-terminal，emacs调用脚本r会阻塞emacs。
</p>
</div>
</div>
<div id="outline-container-sec-3-19" class="outline-3">
<h3 id="sec-3-19"><span class="section-number-3">3.19</span> <span class="done DONE">DONE</span> 如何emacs异步执行shell command？</h3>
<div class="outline-text-3" id="text-3-19">
<p>
？解决m-!执行shell command阻塞emacs。模拟win-r的功能。快速启动程序或文件（普通文件或目录）。
</p>

<pre class="example">
https://www.google.com/search?biw=1280&amp;bih=529&amp;q=+async+emacs+shell+command
https://www.gnu.org/software/emacs/manual/html_node/emacs/Single-Shell.html
A shell command that ends in ‘&amp;’ is executed asynchronously, and you can continue to use Emacs as it runs. You can also type M-&amp; (async-shell-command) to execute a shell command asynchronously; this is exactly like calling M-! with a trailing ‘&amp;’, except that you do not need the ‘&amp;’. The default output buffer for asynchronous shell commands is named ‘*Async Shell Command*’. Emacs inserts the output into this buffer as it comes in, whether or not the buffer is visible in a window.
</pre>

<p>
测试
</p>
<pre class="example">
有效
m-!
gnome-control-center &amp;
python
#subprocess.call(["gnome-control-center"])

无效
python
subprocess.call(["xdg-open","gnomet"])
</pre>

<p>
所以问题在于xdg-open上。
</p>
</div>
</div>
<div id="outline-container-sec-3-20" class="outline-3">
<h3 id="sec-3-20"><span class="section-number-3">3.20</span> <span class="done DONE">DONE</span> 如何emacs异步执行shell command xdg-open？</h3>
<div class="outline-text-3" id="text-3-20">
<p>
？解决异步执行xdg-open无反应问题。模拟win-r的功能。快速启动程序或文件（普通文件或目录）。
</p>

<pre class="example">
https://www.google.com/search?q=async+emacs+xdg-open
https://askubuntu.com/questions/646631/emacs-doesnot-work-with-xdg-open

Now I use setsid -w, which supposedly makes setsid wait until the called program finishes.

man setsid
       -w, --wait
              Wait  for  the  execution  of the program to end, and return the
              exit value of this program as the return value of setsid.
</pre>
</div>
</div>

<div id="outline-container-sec-3-21" class="outline-3">
<h3 id="sec-3-21"><span class="section-number-3">3.21</span> <span class="done DONE">DONE</span> 如何linux gnome取消进程或程序分组？</h3>
<div class="outline-text-3" id="text-3-21">
<p>
？使用m-tab切换不同的emacs进程。
</p>

<pre class="example">
https://www.google.com/search?biw=1280&amp;bih=532&amp;q=gnome+cancel+group
https://askubuntu.com/questions/432022/disable-gnome-compiz-task-switcher-grouping

gsettings set org.gnome.desktop.wm.keybindings switch-applications "['&lt;Super&gt;Tab']"
gsettings set org.gnome.desktop.wm.keybindings switch-applications-backward "['&lt;Shift&gt;&lt;Super&gt;Tab']"
gsettings set org.gnome.desktop.wm.keybindings switch-windows "['&lt;Alt&gt;Tab']"
gsettings set org.gnome.desktop.wm.keybindings switch-windows-backward "['&lt;Shift&gt;&lt;Alt&gt;Tab']"
</pre>

<p>
缺少引用（gsettings get）。
</p>
</div>
</div>
<div id="outline-container-sec-3-22" class="outline-3">
<h3 id="sec-3-22"><span class="section-number-3">3.22</span> <span class="done DONE">DONE</span> 如何gsetting解决设置value时报错unknown keyword？</h3>
<div class="outline-text-3" id="text-3-22">
<p>
？设置gnome切换application为window。gnome取消进程分组。
</p>

<pre class="example">
https://www.google.com/search?q=gsetting+unknown+keyword&amp;ie=utf-8&amp;oe=utf-8
https://askubuntu.com/questions/487206/dconf-change-a-string-key
The value needs additional quoting i.e. to assign GVariant string value 'foo' you need to write the value argument as "'foo'"

# wrong
gsettings set org.gnome.desktop.wm.keybindings switch-windows ['&lt;Alt&gt;Tab']

# right
gsettings set org.gnome.desktop.wm.keybindings switch-windows "['&lt;Alt&gt;Tab']"
gsettings set org.gnome.desktop.wm.keybindings switch-windows-backward "['&lt;Shift&gt;&lt;Alt&gt;Tab']"
</pre>

<p>
使用引号包围值。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yjr</p>
<p class="date">Created: 2017-08-11 Fri 20:05</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
